{
    "questions": [
      {
        "question": "Quel est le principal avantage de l'espionnage logiciel dans le recueil d'informations ?",
        "Reponses": ["Les données sont déjà formatées", "Les utilisateurs participent activement", "Les données sont anonymes", "Les résultats sont instantanés"],
        "BonneReponse": "Les données sont déjà formatées",
        "Explication": "L'espionnage logiciel mémorise les actions des utilisateurs et centralise les informations, les rendant déjà formatées pour un traitement facile."
      },
      {
        "question": "Quel est le but principal des workshops dans le recueil d'informations ?",
        "Reponses": ["Générer des idées", "Observer les utilisateurs", "Analyser des données", "Mémoriser les actions des utilisateurs"],
        "BonneReponse": "Générer des idées",
        "Explication": "Les workshops rassemblent les utilisateurs, responsables et concepteurs pour organiser des activités qui génèrent des idées."
      },
      {
        "question": "Quelle technique de conception emprunte au monde du cinéma pour donner une vue d'ensemble de l'interaction ?",
        "Reponses": ["Storyboards", "Scénarios", "Magicien d'OZ", "Brainstorming"],
        "BonneReponse": "Storyboards",
        "Explication": "Les storyboards utilisent des images, des plans et des sous-titres pour donner une vue d'ensemble de l'interaction."
      },
      {
        "question": "Quelle est la procédure typique pour un brainstorming efficace ?",
        "Reponses": ["Choisir un petit groupe, décrire un problème, générer des idées", "Observer les utilisateurs, enregistrer les actions, analyser les données", "Envoyer des questionnaires, collecter les réponses, analyser les résultats", "Développer des prototypes, tester avec des utilisateurs, recueillir des feedbacks"],
        "BonneReponse": "Choisir un petit groupe, décrire un problème, générer des idées",
        "Explication": "Le brainstorming implique de choisir un petit groupe, de décrire un problème de conception spécifique et de générer autant d'idées que possible."
      },
      {
        "question": "Quel est le but du 'Magicien d'OZ' dans les techniques de conception ?",
        "Reponses": ["Simuler l'intelligence artificielle avec une personne réelle", "Générer des idées créatives", "Créer des descriptions réalistes du travail", "Aider à identifier les problèmes informellement"],
        "BonneReponse": "Simuler l'intelligence artificielle avec une personne réelle",
        "Explication": "Le 'Magicien d'OZ' utilise une personne pour interpréter les entrées de l'utilisateur et contrôler le comportement du système, simulant ainsi une intelligence artificielle."
      },
      {
        "question": "Quel type de scénario est utilisé pour créer une description réaliste de l'utilisation du nouveau système en cours de conception ?",
        "Reponses": ["Scénario de conception", "Scénario de travail", "Story-board", "Prototypage"],
        "BonneReponse": "Scénario de conception",
        "Explication": "Le scénario de conception modifie un scénario de travail existant pour inclure le nouveau système en cours de conception."
      },
      {
        "question": "Quels sont les deux principaux types de brainstorming ?",
        "Reponses": ["Phase de génération d'idées et phase de classification des idées", "Phase d'observation et phase d'analyse", "Phase de prototypage et phase de test", "Phase de développement et phase de validation"],
        "BonneReponse": "Phase de génération d'idées et phase de classification des idées",
        "Explication": "Le brainstorming se compose de deux phases : la génération d'idées et la classification des idées."
      },
      {
        "question": "Dans quelle approche de prototypage une interface utilisateur complète est créée sans fonctionnalité sous-jacente ?",
        "Reponses": ["Horizontale", "Verticale", "Scénario", "Cascade"],
        "BonneReponse": "Horizontale",
        "Explication": "L'approche de prototypage horizontale crée une interface utilisateur complète sans fonctionnalité sous-jacente."
      },
      {
        "question": "Quelle méthode de recueil d'informations demande à l'utilisateur de décrire des incidents critiques et des activités habituelles ?",
        "Reponses": ["Scénario de travail", "Observation directe", "Questionnaires", "Espionnage logiciel"],
        "BonneReponse": "Scénario de travail",
        "Explication": "Le scénario de travail demande aux utilisateurs de décrire des incidents critiques et des activités habituelles."
      },
      {
        "question": "Quelle méthode utilise des règles pour structurer un brainstorming efficace ?",
        "Reponses": ["Brainstorming", "Observation directe", "Scénarios", "Storyboards"],
        "BonneReponse": "Brainstorming",
        "Explication": "Le brainstorming utilise des règles telles que l'enregistrement de toutes les idées et l'absence d'évaluation pendant la phase de génération d'idées."
      },
      {
        "question": "Quelle approche de réalisation d'une application inclut des prototypes et une validation utilisateur en fin de processus ?",
        "Reponses": ["Approche en spirale", "Approche en V", "Approche en cascade", "Prototypage"],
        "BonneReponse": "Approche en spirale",
        "Explication": "L'approche en spirale inclut des prototypes et une validation utilisateur en fin de processus."
      },
      {
        "question": "Dans quelle technique de conception l'utilisateur a-t-il la sensation d'utiliser le 'vrai' système même s'il peut être inexistant ?",
        "Reponses": ["Le magicien d'OZ", "Scénarios", "Prototypage", "Observation directe"],
        "BonneReponse": "Le magicien d'OZ",
        "Explication": "Dans la technique du magicien d'OZ, l'utilisateur a la sensation d'utiliser le 'vrai' système même s'il peut être inexistant."
      },
      {
        "question": "Quelle technique consiste à créer une description réaliste du travail d'un utilisateur, incluant des situations habituelles et inhabituelles ?",
        "Reponses": ["Scénario de travail", "Scénario de conception", "Storyboards", "Design Walkthrough"],
        "BonneReponse": "Scénario de travail",
        "Explication": "Le scénario de travail consiste à créer une description réaliste du travail d'un utilisateur, incluant des situations habituelles et inhabituelles."
      },
      {
        "question": "Quelle méthode de recueil d'informations implique de rassembler utilisateur, responsable et concepteur pour développer de nouvelles versions ensemble ?",
        "Reponses": ["Workshops", "Brainstorming", "Scénarios", "Prototypage"],
        "BonneReponse": "Workshops",
        "Explication": "Les workshops impliquent de rassembler utilisateur, responsable et concepteur pour développer ensemble de nouvelles versions."
      },
      {
        "question": "Quelle est l'approche de réalisation d'une application où les spécifications, l'analyse, la conception, l'implémentation et les tests se déroulent séquentiellement ?",
        "Reponses": ["Approche en cascade", "Approche en V", "Approche en spirale", "Prototypage"],
        "BonneReponse": "Approche en cascade",
        "Explication": "L'approche en cascade se déroule de manière séquentielle avec les étapes de spécifications, analyse, conception, implémentation et tests."
      }
    ]
  }
  